src/Catalogs/КурсыЛечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КурсыЛечения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПациента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКурса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/СтатусыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтатусыКонтрагентов</Name>
			<Comment>Статусы пациентов</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/КурсыЛечения/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
// Обработчик события "ПриСозданииНаСервере" объекта.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	Если Не ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Объект.ДатаНачала = ТекущаяДатаСеанса();
	КонецЕсли;
	ЭтаФорма.ТолькоПросмотр = Истина;
	Элементы.Приемы.Видимость = Не Объект.Ссылка.Пустая();
	Приемы.Параметры.УстановитьЗначениеПараметра("КурсЛечения", Объект.Ссылка);
	Приемы.Параметры.УстановитьЗначениеПараметра("Контрагент" , Объект.Контрагент);
    РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);

КонецПроцедуры 

&НаСервере
// Обработчик события "ПриЧтенииНаСервере" объекта.
//
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
КонецПроцедуры

&НаСервере
// Обработчик события "ПослеЗаписиНаСервере" объекта.
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - Контрагент при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда 
		ДатаНачала = ?(Не ЗначениеЗаполнено(Объект.ДатаНачала), Неопределено, Объект.ДатаНачала);
		Объект.СтатусПациента = ПолучитьСтатусКлиента(Объект.Контрагент, ДатаНачала); 
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедцрыИФункции

// Функция - Получить статус клиента
//
// Параметры:
//  Контрагент	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаСервереБезКонтекста
Функция ПолучитьСтатусКлиента(Контрагент, ДатаНачала) 
	
	Возврат РегистрыСведений.СтатусыКонтрагентов.ПолучитьСтатусКлиента(Контрагент, ДатаНачала);
	
КонецФункции

#КонецОбласти
